#### BuiltInFailures.ViewSheetFailures Members

---

|  |
| --- |
| BuiltInFailures ViewSheetFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ViewSheetFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ViewInAModelMustBeUnique | Sheet views in this model cannot contain more than one instance of "%1!s!." |
| Public property Static member | ViewInAModelMustBeUniqueWarn | Sheet views in this model cannot contain more than one instance of "%1!s!." |
| Public property Static member | ViewOnASheetCannotBeUncropped3DPerspectiveView | Sheets do not support uncropped perspective views. |
| Public property Static member | ViewOnASheetMustBeUnique | Sheet views cannot contain more than one instance of "%1!s!." |
| Public property Static member | ViewOnASheetMustBeUniqueWarn | Sheet views cannot contain more than one instance of "%1!s!." |
| Public property Static member | ViewportCantContainEmptyView | Sheet views cannot contain empty view "%1!s!". |

# See Also

BuiltInFailures ViewSheetFailures Class

Autodesk.Revit.DB Namespace